Ran Plan for project: `wrestleutopia-prod` dir: `accounts/wrestleutopia-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_dashboard.efs_dashboard will be created
+ resource "aws_cloudwatch_dashboard" "efs_dashboard" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = jsonencode(
            {
              + widgets = [
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/EFS",
                                  + "BurstCreditBalance",
                                  + "FileSystemId",
                                  + "fs-0f8bba7d2ef5709ea",
                                ],
                            ]
                          + region  = "us-east-2"
                          + stat    = "Average"
                          + title   = "BurstCreditBalance"
                        }
                      + type       = "metric"
                      + width      = 6
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/EFS",
                                  + "ClientConnections",
                                  + "FileSystemId",
                                  + "fs-0f8bba7d2ef5709ea",
                                ],
                            ]
                          + region  = "us-east-2"
                          + stat    = "Average"
                          + title   = "ClientConnections"
                        }
                      + type       = "metric"
                      + width      = 6
                      + x          = 6
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/EFS",
                                  + "DataReadIOBytes",
                                  + "FileSystemId",
                                  + "fs-0f8bba7d2ef5709ea",
                                ],
                            ]
                          + region  = "us-east-2"
                          + stat    = "Sum"
                          + title   = "DataReadIOBytes"
                        }
                      + type       = "metric"
                      + width      = 6
                      + x          = 0
                      + y          = 6
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/EFS",
                                  + "DataWriteIOBytes",
                                  + "FileSystemId",
                                  + "fs-0f8bba7d2ef5709ea",
                                ],
                            ]
                          + region  = "us-east-2"
                          + stat    = "Sum"
                          + title   = "DataWriteIOBytes"
                        }
                      + type       = "metric"
                      + width      = 6
                      + x          = 6
                      + y          = 6
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/EFS",
                                  + "PercentIOLimit",
                                  + "FileSystemId",
                                  + "fs-0f8bba7d2ef5709ea",
                                ],
                            ]
                          + region  = "us-east-2"
                          + stat    = "Average"
                          + title   = "PercentIOLimit"
                        }
                      + type       = "metric"
                      + width      = 6
                      + x          = 0
                      + y          = 12
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "AWS/EFS",
                                  + "TotalIOBytes",
                                  + "FileSystemId",
                                  + "fs-0f8bba7d2ef5709ea",
                                ],
                            ]
                          + region  = "us-east-2"
                          + stat    = "Sum"
                          + title   = "TotalIOBytes"
                        }
                      + type       = "metric"
                      + width      = 6
                      + x          = 6
                      + y          = 12
                    },
                ]
            }
        )
      + dashboard_name = "efs-monitoring-dashboard"
      + id             = (known after apply)
    }

  # aws_cloudwatch_dashboard.lambdas_dashboard will be updated in-place
~ resource "aws_cloudwatch_dashboard" "lambdas_dashboard" {
      ~ dashboard_body = jsonencode(
          ~ {
              ~ widgets = [
                  ~ {
                      ~ properties = {
                          ~ metrics = [
                                [
                                    "AWS/Lambda",
                                    "Errors",
                                    "FunctionName",
                                    "fetch_data",
                                ],
                              + [
                                  + ".",
                                  + "Errors",
                                  + "FunctionName",
                                  + "check_duplicate",
                                ],
                                [
                                    ".",
                                    "Errors",
                                    "FunctionName",
                                    "process_content",
                                ],
                                # (2 unchanged elements hidden)
                                [
                                    ".",
                                    "Errors",
                                    "FunctionName",
                                    "notify_post",
                                ],
                              + [
                                  + ".",
                                  + "Errors",
                                  + "FunctionName",
                                  + "sns_to_teams",
                                ],
                            ]
                            # (4 unchanged attributes hidden)
                        }
                        # (5 unchanged attributes hidden)
                    },
                  ~ {
                      ~ properties = {
                          ~ metrics = [
                                [
                                    "AWS/Lambda",
                                    "Throttles",
                                    "FunctionName",
                                    "fetch_data",
                                ],
                              + [
                                  + ".",
                                  + "Throttles",
                                  + "FunctionName",
                                  + "check_duplicate",
                                ],
                                [
                                    ".",
                                    "Throttles",
                                    "FunctionName",
                                    "process_content",
                                ],
                                # (2 unchanged elements hidden)
                                [
                                    ".",
                                    "Throttles",
                                    "FunctionName",
                                    "notify_post",
                                ],
                              + [
                                  + ".",
                                  + "Throttles",
                                  + "FunctionName",
                                  + "sns_to_teams",
                                ],
                            ]
                            # (4 unchanged attributes hidden)
                        }
                        # (5 unchanged attributes hidden)
                    },
                  ~ {
                      ~ properties = {
                          - alarms  = [
                              - "arn:aws:cloudwatch:us-east-2:390402544450:alarm:wrestleutopia-fetch-data-errors",
                            ]
                          + metrics = [
                              + [
                                  + "AWS/Lambda",
                                  + "Duration",
                                  + "FunctionName",
                                  + "fetch_data",
                                  + {
                                      + stat = "Average"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "Duration",
                                  + "FunctionName",
                                  + "check_duplicate",
                                  + {
                                      + stat = "Average"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "Duration",
                                  + "FunctionName",
                                  + "process_content",
                                  + {
                                      + stat = "Average"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "Duration",
                                  + "FunctionName",
                                  + "store_data",
                                  + {
                                      + stat = "Average"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "Duration",
                                  + "FunctionName",
                                  + "render_video",
                                  + {
                                      + stat = "Average"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "Duration",
                                  + "FunctionName",
                                  + "notify_post",
                                  + {
                                      + stat = "Average"
                                    },
                                ],
                              + [
                                  + ".",
                                  + "Duration",
                                  + "FunctionName",
                                  + "sns_to_teams",
                                  + {
                                      + stat = "Average"
                                    },
                                ],
                            ]
                          + period  = 300
                          + region  = "us-east-2"
                          ~ title   = "Lambda Alarms" -> "Lambda Duration (Average)"
                        }
                      ~ type       = "alarm" -> "metric"
                      ~ width      = 24 -> 12
                        # (3 unchanged attributes hidden)
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + alarms = [
                              + "arn:aws:cloudwatch:us-east-2:390402544450:alarm:wrestleutopia-fetch-data-errors",
                              + "arn:aws:cloudwatch:us-east-2:390402544450:alarm:wrestleutopia-check_duplicate-errors",
                              + "arn:aws:cloudwatch:us-east-2:390402544450:alarm:wrestleutopia-process_content-errors",
                              + "arn:aws:cloudwatch:us-east-2:390402544450:alarm:wrestleutopia-store_data-errors",
                              + "arn:aws:cloudwatch:us-east-2:390402544450:alarm:wrestleutopia-render_video-errors",
                              + "arn:aws:cloudwatch:us-east-2:390402544450:alarm:wrestleutopia-notify_post-errors",
                            ]
                          + title  = "Lambda Alarms"
                        }
                      + type       = "alarm"
                      + width      = 12
                      + x          = 12
                      + y          = 6
                    },
                ]
            }
        )
        id             = "LambdaDashboard"
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_dashboard.step_functions_dashboard will be updated in-place
~ resource "aws_cloudwatch_dashboard" "step_functions_dashboard" {
      ~ dashboard_body = jsonencode(
            {
              - widgets = [
                  - {
                      - height     = 6
                      - properties = {
                          - metrics = [
                              - [
                                  - "AWS/States",
                                  - "ExecutionsStarted",
                                  - "StateMachineArn",
                                  - "arn:aws:states:us-east-2:390402544450:stateMachine:automated_wrestleutopia_workflow",
                                ],
                              - [
                                  - ".",
                                  - "ExecutionsSucceeded",
                                  - ".",
                                  - ".",
                                ],
                              - [
                                  - ".",
                                  - "ExecutionsFailed",
                                  - ".",
                                  - ".",
                                ],
                            ]
                          - period  = 300
                          - region  = "us-east-2"
                          - stat    = "Sum"
                          - title   = "Step Function Executions"
                        }
                      - type       = "metric"
                      - width      = 12
                      - x          = 0
                      - y          = 0
                    },
                  - {
                      - height     = 6
                      - properties = {
                          - alarms = [
                              - "arn:aws:cloudwatch:us-east-2:390402544450:alarm:wrestleutopia-automated-workflow-failures",
                            ]
                          - title  = "Step Function Alarms"
                        }
                      - type       = "alarm"
                      - width      = 12
                      - x          = 12
                      - y          = 0
                    },
                ]
            }
        ) -> (known after apply)
        id             = "StepFunctionsDashboard"
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_dashboard.vpc_monitoring will be created
+ resource "aws_cloudwatch_dashboard" "vpc_monitoring" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = jsonencode(
            {
              + widgets = [
                  + {
                      + height     = 6
                      + properties = {
                          + metrics = [
                              + [
                                  + "VPCFlowLogs",
                                  + "NumRejectedRequests",
                                ],
                            ]
                          + period  = 300
                          + stat    = "Sum"
                          + title   = "Rejected Traffic Over Time"
                        }
                      + type       = "metric"
                      + width      = 12
                      + x          = 0
                      + y          = 0
                    },
                ]
            }
        )
      + dashboard_name = "vpc-monitoring"
      + id             = (known after apply)
    }

  # aws_cloudwatch_log_metric_filter.vpc_flow_logs_rejected_filter will be created
+ resource "aws_cloudwatch_log_metric_filter" "vpc_flow_logs_rejected_filter" {
      + id             = (known after apply)
      + log_group_name = "/aws/vpc/flow_logs/vpc-0ee2aacdd3db268d8"
      + name           = "VPCFlowLogsRejectedRequests"
      + pattern        = "[version, account_id, interface_id, srcaddr, dstaddr, srcport, dstport, protocol, packets, bytes, start, end, action=REJECT, log_status]"

      + metric_transformation {
          + name      = "NumRejectedRequests"
          + namespace = "VPCFlowLogs"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.automated_workflow_aborts will be created
+ resource "aws_cloudwatch_metric_alarm" "automated_workflow_aborts" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-2:390402544450:wrestleutopia-monitoring-topic",
        ]
      + alarm_description                     = "Alert if the automated Step Function is aborted within a 5-minute window."
      + alarm_name                            = "wrestleutopia-automated-workflow-aborts"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "StateMachineArn" = "arn:aws:states:us-east-2:390402544450:stateMachine:automated_wrestleutopia_workflow"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ExecutionsAborted"
      + namespace                             = "AWS/States"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.automated_workflow_timeouts will be created
+ resource "aws_cloudwatch_metric_alarm" "automated_workflow_timeouts" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-2:390402544450:wrestleutopia-monitoring-topic",
        ]
      + alarm_description                     = "Alert if the automated Step Function times out within a 5-minute window."
      + alarm_name                            = "wrestleutopia-automated-workflow-timeouts"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "StateMachineArn" = "arn:aws:states:us-east-2:390402544450:stateMachine:automated_wrestleutopia_workflow"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ExecutionsTimedOut"
      + namespace                             = "AWS/States"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.check_duplicate_duration_high will be created
+ resource "aws_cloudwatch_metric_alarm" "check_duplicate_duration_high" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-2:390402544450:wrestleutopia-monitoring-topic",
        ]
      + alarm_description                     = "Alert if check_duplicate function average duration exceeds 3s in a 5-minute window."
      + alarm_name                            = "wrestleutopia-check_duplicate-duration-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "check_duplicate"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Duration"
      + namespace                             = "AWS/Lambda"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + threshold                             = 3000
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.check_duplicate_memory_high will be created
+ resource "aws_cloudwatch_metric_alarm" "check_duplicate_memory_high" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-2:390402544450:wrestleutopia-monitoring-topic",
        ]
      + alarm_description                     = "Alert if check_duplicate memory usage exceeds 500 MB in a 5-minute window."
      + alarm_name                            = "wrestleutopia-check_duplicate-memory-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "check_duplicate"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "max_memory_used"
      + namespace                             = "LambdaInsights"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + threshold                             = 500
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.fetch_data_duration_high will be created
+ resource "aws_cloudwatch_metric_alarm" "fetch_data_duration_high" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-2:390402544450:wrestleutopia-monitoring-topic",
        ]
      + alarm_description                     = "Alert if fetch_data function average duration exceeds 4s in a 5-minute window."
      + alarm_name                            = "wrestleutopia-fetch_data-duration-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "fetch_data"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Duration"
      + namespace                             = "AWS/Lambda"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + threshold                             = 4000
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.fetch_data_memory_high will be created
+ resource "aws_cloudwatch_metric_alarm" "fetch_data_memory_high" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-2:390402544450:wrestleutopia-monitoring-topic",
        ]
      + alarm_description                     = "Alert if fetch_data memory usage exceeds 900 MB in a 5-minute window."
      + alarm_name                            = "wrestleutopia-fetch_data-memory-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "fetch_data"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "max_memory_used"
      + namespace                             = "LambdaInsights"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + threshold                             = 900
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.notify_post_duration_high will be created
+ resource "aws_cloudwatch_metric_alarm" "notify_post_duration_high" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-2:390402544450:wrestleutopia-monitoring-topic",
        ]
      + alarm_description                     = "Alert if notify_post function average duration exceeds 2s in a 5-minute window."
      + alarm_name                            = "wrestleutopia-notify_post-duration-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "notify_post"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Duration"
      + namespace                             = "AWS/Lambda"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + threshold                             = 2000
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.notify_post_memory_high will be created
+ resource "aws_cloudwatch_metric_alarm" "notify_post_memory_high" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-2:390402544450:wrestleutopia-monitoring-topic",
        ]
      + alarm_description                     = "Alert if notify_post memory usage exceeds 300 MB in a 5-minute window."
      + alarm_name                            = "wrestleutopia-notify_post-memory-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "notify_post"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "max_memory_used"
      + namespace                             = "LambdaInsights"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + threshold                             = 300
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.process_content_duration_high will be created
+ resource "aws_cloudwatch_metric_alarm" "process_content_duration_high" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-2:390402544450:wrestleutopia-monitoring-topic",
        ]
      + alarm_description                     = "Alert if process_content function average duration exceeds 5s in a 5-minute window."
      + alarm_name                            = "wrestleutopia-process_content-duration-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "process_content"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Duration"
      + namespace                             = "AWS/Lambda"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + threshold                             = 5000
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.process_content_memory_high will be created
+ resource "aws_cloudwatch_metric_alarm" "process_content_memory_high" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-2:390402544450:wrestleutopia-monitoring-topic",
        ]
      + alarm_description                     = "Alert if process_content memory usage exceeds 900 MB in a 5-minute window."
      + alarm_name                            = "wrestleutopia-process_content-memory-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "process_content"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "max_memory_used"
      + namespace                             = "LambdaInsights"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + threshold                             = 900
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.render_video_duration_high will be created
+ resource "aws_cloudwatch_metric_alarm" "render_video_duration_high" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-2:390402544450:wrestleutopia-monitoring-topic",
        ]
      + alarm_description                     = "Alert if render_video function average duration exceeds 20s in a 5-minute window."
      + alarm_name                            = "wrestleutopia-render_video-duration-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "render_video"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Duration"
      + namespace                             = "AWS/Lambda"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + threshold                             = 40000
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.render_video_memory_high will be created
+ resource "aws_cloudwatch_metric_alarm" "render_video_memory_high" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-2:390402544450:wrestleutopia-monitoring-topic",
        ]
      + alarm_description                     = "Alert if render_video memory usage exceeds 2700 MB in a 5-minute window."
      + alarm_name                            = "wrestleutopia-render_video-memory-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "render_video"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "max_memory_used"
      + namespace                             = "LambdaInsights"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + threshold                             = 2700
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.store_data_duration_high will be created
+ resource "aws_cloudwatch_metric_alarm" "store_data_duration_high" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-2:390402544450:wrestleutopia-monitoring-topic",
        ]
      + alarm_description                     = "Alert if store_data function average duration exceeds 4s in a 5-minute window."
      + alarm_name                            = "wrestleutopia-store_data-duration-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "store_data"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Duration"
      + namespace                             = "AWS/Lambda"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + threshold                             = 4000
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.store_data_memory_high will be created
+ resource "aws_cloudwatch_metric_alarm" "store_data_memory_high" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-2:390402544450:wrestleutopia-monitoring-topic",
        ]
      + alarm_description                     = "Alert if store_data memory usage exceeds 900 MB in a 5-minute window."
      + alarm_name                            = "wrestleutopia-store_data-memory-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "store_data"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "max_memory_used"
      + namespace                             = "LambdaInsights"
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + threshold                             = 900
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.vpc_flow_logs_rejected_alarm will be created
+ resource "aws_cloudwatch_metric_alarm" "vpc_flow_logs_rejected_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-2:390402544450:wrestleutopia-monitoring-topic",
        ]
      + alarm_description                     = "Triggers if we see more than 100 REJECTed flow records in 5 minutes"
      + alarm_name                            = "vpc-flow-logs-rejected-traffic-alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "NumRejectedRequests"
      + namespace                             = "VPCFlowLogs"
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + threshold                             = 100
      + treat_missing_data                    = "missing"
    }

  # aws_guardduty_detector.main will be created
+ resource "aws_guardduty_detector" "main" {
      + account_id                   = (known after apply)
      + arn                          = (known after apply)
      + enable                       = true
      + finding_publishing_frequency = (known after apply)
      + id                           = (known after apply)
      + tags_all                     = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }

      + datasources (known after apply)
    }

  # aws_iam_role_policy.step_functions_xray will be created
+ resource "aws_iam_role_policy" "step_functions_xray" {
      + id          = (known after apply)
      + name        = "step-functions-xray-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowXRayWrites"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "wrestleutopia_step_functions_role"
    }

  # aws_sfn_state_machine.automated_workflow will be updated in-place
~ resource "aws_sfn_state_machine" "automated_workflow" {
        id                        = "arn:aws:states:us-east-2:390402544450:stateMachine:automated_wrestleutopia_workflow"
        name                      = "automated_wrestleutopia_workflow"
        tags                      = {}
        # (12 unchanged attributes hidden)

      ~ tracing_configuration {
          ~ enabled = false -> true
        }

        # (2 unchanged blocks hidden)
    }

  # aws_xray_sampling_rule.critical_service_rule will be updated in-place
~ resource "aws_xray_sampling_rule" "critical_service_rule" {
        id             = "CriticalService"
      ~ service_name   = "my-critical-service" -> "critical"
        tags           = {}
        # (13 unchanged attributes hidden)
    }

Plan: 20 to add, 4 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p wrestleutopia-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fwrestleutopia-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p wrestleutopia-prod
  ```
Plan: 20 to add, 4 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```